% 铰链四杆机构实现连杆轨迹的优化设计
% 设计变量： x(1)-机架;x(2)-曲柄;x(3)-连杆;x(4)-摇杆;x(5)-连杆附杆;
% x(6)-机架倾斜角beta;x(7)-连杆与附杆夹角gamma;x(8)-曲柄相初始角theta0;
x0=[46.55;27.33;59.07;61.29;61.89;0;22.21;0];%初始点
ub=[50;30;63;63;63;5;30;2];%设置上界
lb=[45;25;55;57;55;-5;0;-2];%设置下界
% 调用非线性优化函数
[xopt,fopt]=fmincon(@mubiao,x0,[],[],[],[],lb,ub,@yueshu);

disp ' ********   铰链四杆机构实现连杆轨迹的优化设计最优解  ********'  
fprintf ('             机架长度             d = %3.4f mm \n',xopt(1))
fprintf ('             曲柄长度             a = %3.4f mm \n',xopt(2))
fprintf ('             连杆长度             b = %3.4f mm \n',xopt(3))
fprintf ('             摇杆长度             c = %3.4f mm \n',xopt(4))
fprintf ('             连杆附杆长度         h = %3.4f mm \n',xopt(5))
fprintf ('             机架倾斜角        beta = %3.4f ° \n',xopt(6))
fprintf ('             连杆与附杆夹角   gamma = %3.4f ° \n',xopt(7))
fprintf ('             曲柄初始位置角  theta0 = %3.4f ° \n',xopt(8))
fprintf ('             M点轨迹坐标偏差     f* = %3.4f    \n',fopt)
hd=pi/180;
delta_n=acos((xopt(3)^2+xopt(4)^2-(xopt(1)-xopt(2))^2)/(2*xopt(3)*xopt(4)));
fprintf ('             机构最小传动角 delta_min = %3.4f ° \n',delta_n/hd);



%
[g,ceq]=yueshu(xopt);
disp '          ========    最优点的约束函数值    ========'
fprintf ('            最小传动角约束函数值     g1* = %3.4f \n',g(1))
fprintf ('            曲柄长度<=机架长度       g2* = %3.4f \n',g(2))
fprintf ('            曲柄长度<=连杆长度       g3* = %3.4f \n',g(3))
fprintf ('            曲柄长度<=摇杆长度       g4* = %3.4f \n',g(4))
fprintf ('            曲柄+机架<=摇杆+连杆     g5* = %3.4f \n',g(5))
fprintf ('            曲柄+连杆<=摇杆+机架     g6* = %3.4f \n',g(6))
fprintf ('            曲柄+摇杆<=连杆+机架     g7* = %3.4f \n',g(7))
fprintf ('            机架长度<=60            g8* = %3.4f \n',g(8))
fprintf ('            曲柄长度>=8             g9* = %3.4f \n',g(9))
fprintf ('            曲柄长度<=30           g10* = %3.4f \n',g(10))
fprintf ('            连杆长度<=70           g11* = %3.4f \n',g(11))
fprintf ('            摇杆长度<=70           g12* = %3.4f \n',g(12))
fprintf ('            附杆长度>=30           g13* = %3.4f \n',g(13))
fprintf ('            附杆长度<=70           g14* = %3.4f \n',g(14))
fprintf ('            机架倾斜角>=-20°      g15* = %3.4f \n',g(15))
fprintf ('            机架倾斜角<=30°       g16* = %3.4f \n',g(16))
fprintf ('            连杆附杆夹角>=0°      g17* = %3.4f \n',g(17))
fprintf ('            连杆附杆夹角<=30°     g18* = %3.4f \n',g(18))
fprintf ('            曲柄初始角>=0°        g19* = %3.4f \n',g(19))
fprintf ('            曲柄初始角<=15°       g20* = %3.4f \n',g(20))
           
%  铰链四杆机构实现连杆轨迹的优化设计--目标函数文件---mubiao.m
function f=mubiao(x)
% 曲柄输入角增量
Dtheta=[70,94,117,134,159,178.5,-130.5,-143];
% 连杆上M点给定的坐标
Sx=[5.63 -3.66 -12.09 -17.54 -24.9 -27.31 -26.88 -22.88];
Sy=[26.74 27.08 24.51  20.96  11.27 0.96  -4.91 -14.95];
% 目标函数
hd=pi/180;
theta=x(8)+Dtheta;                    % 曲柄输入角=初始角+角增量
epsilon=atan(x(2).*sin((theta-x(6))*hd)/(x(1)-x(2).*cos((theta-x(6))*hd)));
    etaz=x(1)^2+x(2)^2+x(3)^2-x(4)^2-2*x(1)*x(2).*cos((theta-x(6))*hd);
    etam=2*x(3)*sqrt(x(1)^2+x(2)^2-2*x(1)*x(2).*cos((theta-x(6))*hd));
eta=etaz./etam;
phi=x(6)+x(7)+eta-epsilon;
Mx=x(2).*cos(theta*hd)+x(5).*cos(phi*hd);        % 连杆上M点实际x坐标
My=x(2).*sin(theta*hd)+x(5).*sin(phi*hd);        % 连杆上M点实际y坐标
f=sqrt(sum((Mx-Sx).^2+(My-Sy).^2)/8);            % M点坐标偏差均方根值
end

%  铰链四杆机构实现连杆轨迹的优化设计--约束函数文件---yueshu.m


function [g,ceq]=yueshu(x)
% 机构最小传动角(40度)约束
g(1)=x(3)^2+x(4)^2-(x(1)-x(2))^2-2*x(3)*x(4)*cos(40*pi/180);
% 曲柄存在条件约束
g(2)=-x(1)+x(2);                     % 曲柄长度 <= 机架长度
g(3)=-x(3)+x(2);                     % 曲柄长度 <= 连杆长度
g(4)=-x(4)+x(2);                     % 曲柄长度 < 摇杆长度
g(5)=x(1)+x(2)-x(3)-x(4);            % 曲柄 + 机架 <= 摇杆 + 连杆
g(6)=-x(1)+x(2)+x(3)-x(4);           % 曲柄 + 连杆 <= 摇杆 + 机架
g(7)=-x(1)+x(2)-x(3)+x(4);           % 曲柄 + 摇杆 <= 连杆 + 机架
% 边界约束
g(8)=x(1)-60;                        % 机架 <= 60
g(9)=8-x(2);g(10)=x(2)-30;           % 8 <= 曲柄 <= 30
g(11)=x(3)-70;                       % 连杆 <= 70
g(12)=x(4)-70;                       % 摇杆 <= 70
g(13)=30-x(5);g(14)=x(5)-70;         % 30 <= 连杆附杆 <= 70
g(15)=-x(6)-20;g(16)=x(6)-30;        % -20度 <= 机架倾斜角 <= 30度
g(17)=-x(7);g(18)=x(7)-30;           % 0度 <= 连杆附杆夹角 <= 30度
g(19)=-x(8);g(20)=x(8)-60;           % 0度 <= 曲柄初始角 <= 60度
ceq=[];                              % 没有非线性等式约束
end
